
## Plan Result (stg)




<pre><code>Plan: 5 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.vm_contributor[0]
  * azurerm_virtual_machine_extension.aad[0]
  * azurerm_virtual_machine_extension.edit_init[0]
  * module.edit_vm[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
  * module.edit_vm[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.endpoint_protection[0]
* Update
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.vm_contributor[0] will be created
  + resource "azurerm_role_assignment" "vm_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ad922d96-041a-4fd0-ac58-9205d3e5b33d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_virtual_machine_extension.aad[0] will be created
  + resource "azurerm_virtual_machine_extension" "aad" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AADLoginForWindows"
      + publisher                   = "Microsoft.Azure.ActiveDirectory"
      + tags                        = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + type                        = "AADLoginForWindows"
      + type_handler_version        = "1.0"
      + virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg"
    }

  # azurerm_virtual_machine_extension.edit_init[0] will be created
  + resource "azurerm_virtual_machine_extension" "edit_init" {
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "toolingScript"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Compute"
      + tags                        = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + type                        = "CustomScriptExtension"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg"
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                               = "prefinalsastg"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
        name                               = "preingestsastg"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.edit_vm[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be created
  + resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "Dynatrace"
      + publisher                   = "dynatrace.ruxit"
      + settings                    = (sensitive value)
      + tags                        = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + type                        = "oneAgentWindows"
      + type_handler_version        = "2.200"
      + virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg"
    }

  # module.edit_vm[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.endpoint_protection[0] will be created
  + resource "azurerm_virtual_machine_extension" "endpoint_protection" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AntiMalwareEndpointProtection"
      + publisher                   = "Microsoft.Azure.Security"
      + settings                    = <<-EOT
            {
                  "AntimalwareEnabled": "true",
                  "RealtimeProtectionEnabled": "true",
                  "ScheduledScanSettings": {"day":"7","isEnabled":"true","scanType":"Quick","time":"120"}
                }
        EOT
      + tags                        = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + type                        = "IaaSAntimalware"
      + type_handler_version        = "1.6"
      + virtual_machine_id          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg"
    }

Plan: 5 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":909,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->